In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
# Lets create some data to play with:

# Note: It is not necessary to understand how this dataset was made to understand this Lecture.

#import pandas testing utility
import pandas.util.testing as tm; tm.N = 3

#Create a unpivoted function
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    
    # Return the DataFrame
    return DataFrame(data, columns=['date', 'variable', 'value'])

#Set the DataFrame we'll be using
dframe = unpivot(tm.makeTimeDataFrame())

In [3]:
dframe

         date variable     value
0  2000-01-03        A -1.705349
1  2000-01-04        A  0.071947
2  2000-01-05        A -0.054253
3  2000-01-03        B  0.204365
4  2000-01-04        B -0.116792
5  2000-01-05        B  1.239817
6  2000-01-03        C -0.059304
7  2000-01-04        C -1.335471
8  2000-01-05        C  1.850188
9  2000-01-03        D  0.262728
10 2000-01-04        D -1.026045
11 2000-01-05        D -2.257101

In [4]:
dframe_piv = dframe.pivot('date', 'variable', 'value')

In [5]:
dframe_piv

variable           A         B         C         D
date
2000-01-03 -1.705349  0.204365 -0.059304  0.262728
2000-01-04  0.071947 -0.116792 -1.335471 -1.026045
2000-01-05 -0.054253  1.239817  1.850188 -2.257101

In [31]:
dframe1 = DataFrame({'type': ['food', 'food', 'pubs', 'entertianment'], 
                     'date': ['10.10.2015', '11.10.2015', '12.10.2015', '13.10.2015'],
                     'prices': np.arange(4)})

In [32]:
dframe1

         date  prices           type
0  10.10.2015       0           food
1  11.10.2015       1           food
2  12.10.2015       2           pubs
3  13.10.2015       3  entertianment

In [34]:
dframe_piv1 = dframe1.pivot('date', 'type', 'prices')

In [38]:
dframe_piv1

type        entertianment  food  pubs
date
10.10.2015            NaN     0   NaN
11.10.2015            NaN     1   NaN
12.10.2015            NaN   NaN     2
13.10.2015              3   NaN   NaN

In [37]:
dframe_piv1.sum()

type
entertianment    3
food             1
pubs             2
dtype: float64